1. Все в одну сеть net1, net2, net3
2. Меняем дату и время на всех машинах
3. Ставим айпишники на всех машинах
net1-admin, net1-open, net1-operCA – 1.2.3.0 /255.255.255.240/ 1.2.3.5(шлюз везде один)
net2-operCA – 2.3.4.1/255.255.255.224/2.3.4.5
net3-admin, net3-open – 5.6.7.0/255.255.255.192/5.6.7.5
4. Выключаем брэндмауэр ВЕЗДЕ
5. ¬¬на net1-open – SQL, клиент ЦУС(открывать через повершел/ start(расположение файла).msi)
6. на net1-admin – Visual, сервер ЦУС, сервер УКЦ, VipNet Client
7. на net1-operCA – VipNet Client, registration, Publication, informing
8. на net2-operCA - VipNet Client, registration, Publication, informing
9. на net3-admin – Visual, сервер ЦУС и клиент ЦУС, сервер УКЦ, VipNet Client
10. подключаем цус на net1-admin к SQL
11. заходим в цус на net3-admin (не вводя никакие IP, подключаемся без данных)
12. заходим в укц на net3-admin(не вводя никакие IP, подключаемся без данных)
13. Переходим в net1-open и начинаем создавать ключи в ЦУС
Координатор Центр Офис – роли узла удаляем и добавляем HW-VA/ межсерверные каналы – добавляем Кооридантор Филиал
Координатор Филиал – роли узла удаляем и добавляем HW-VA
Клиенты:
Главный Администратор – коорд ЦО
Оператор УЦ – коорд ЦО
Пользователь_2 Филиал – коорд Филиал
Пользователи:
AdminCA – узел Главный Администратор
CoordinatorCA – узел коорд ЦО
CoordinatorFilial – узел коорд филиал
OperCA – узел Оператор УЦ
User – узел Пользователь_2 Филиал
После того как создали всё выше перечисленные, переходим в «клиенты»-> «Оператор Уц»-> «Роли узла» - добавляем Registration Point
Далее переходим в «пользователи» -> «AdminCA»-> «Связи с пользователями»-> «Добавить»-> «Связь с пользователями..»-> «CoordinatorCA, OperCA, User» - сохраняем
 Далее переходим в «пользователи» -> «CoordinatorCA»-> «Связи с пользователями»-> «Добавить»-> «Связь с пользователями..»-> «CoordinatorFilial, OperCA,» - сохраняем
Далее переходим в «пользователи» -> «CoordinatorFilial»-> «Связи с пользователями»-> «Добавить»-> «Связь с пользователями..»-> «OperCA, User» - сохраняем
Далее переходим в «пользователи» -> «OperCA»-> «Связи с пользователями»-> «Добавить»-> «Связь с пользователями..»-> «User» - сохраняем
Затем -> «Справочники и ключи»-> «Создать справочники»-> «Создать для всего списка»
14. Переходим в net1-admin и заходим в УКЦ (если справочники не появились, перезапускаем УКЦ)
«Сетевые узлы»-> “выделяем все справчночники-> ПКМ”-> «выдать дистрибутив ключей» и выдаем пароли
добавляем адаптер 2.0 на машине
Создаем папку «keys» туда переносим папки с созданными ключами, а затем эту папку переносим на диск с файлами випнета и на флешку
15. Переходим в координатор 1 
Вводим логин пароль, выбираем фулл скрин интерфес и пролистываем до начала запуска ключей, подключаем флешку и там выбираем папку «Координатор ЦО» и продолжаем инициализацию
Переходим в координатор 2
Делаем все тоже самое соотв. Выбираем «Координатор филиал»
16. Переходим на net1-admin в випнет клиент
«фильтры открытой сети»-> «создать»-> «ПРОПУСКАТЬ ТРАФИК»-> «применить»-> «защищенная сеть»
17. Переходим в net1-operCA в випнет клиент
«фильтры открытой сети»-> «создать»-> «ПРОПУСКАТЬ ТРАФИК»-> «применить» -> «защищенная сеть»
18. Переходим в net2-operCA в випнет клиент
«фильтры открытой сети»-> «создать»-> «ПРОПУСКАТЬ ТРАФИК»-> «применить» -> «защищенная сеть»
19. Идем в net1-admin во вкладке защищенная сеть нажимаем в верху экрана ПО «проверить»
20. Идем в net1-operCA во вкладке защищенная сеть нажимаем в верху экрана ПО «проверить»
21. Идем в net2- operCA во вкладке защищенная сеть нажимаем в верху экрана ПО «проверить»
22. Переходим на net3-admin и начинаем создавать ключи в ЦУС
Координатор Офис - роли узла удаляем и добавляем HW-VA
Клиент: Администратор офис – коорд офис
Пользователи: 
Координатор офис – сетевой узел – коорд офис
Администратор офис- сетевой узел – Администратор офис
Затем -> «Справочники и ключи»-> «Создать справочники»-> «Создать для всего списка»
23. На этой же машине net3-admin переходим в УКЦ 
«Сетевые узлы»-> “выделяем все справчночники-> ПКМ”-> «выдать дистрибутив ключей» и выдаем пароли
добавляем адаптер 2.0 на машине
Создаем папку «keys» туда переносим папки с созданными ключами, а затем эту папку переносим на диск с файлами випнета и на флешку
24. Переходим в координатор 3
Вводим логин пароль, выбираем фулл скрин интерфес и пролистываем до начала запуска ключей, подключаем флешку и там выбираем папку «Координатор ЦО» и продолжаем инициализацию
25. Переходим на net3-admin в випнет клиент
«фильтры открытой сети»-> «создать»-> «ПРОПУСКАТЬ ТРАФИК»-> «применить»-> «защищенная сеть»
во вкладке защищенная сеть нажимаем в верху экрана ПО «проверить»
26. ¬¬на net1-open в ЦУС
Создаем Клиента:
Ivanov – коорд филиал
Создаем пользователя:
(пользователь Ivanov должен был добавиться автоматически, если нет, добавьте сами)
Petrov – сетевой узел Пользователь_2 Филиал
Далее переходим в «пользователи» -> «Ivanov»-> «Связи с пользователями»-> «Добавить»-> «Связь с пользователями..»-> «Petrov» - сохраняем
Далее переходим в «пользователи» -> «Petrov»-> «Связи с пользователями»-> «Добавить»-> «Связь с пользователями..»-> «ВЫБИРАЕМ ВСЕХ» - сохраняем 
После этого -> «моя сеть»-> «сохранить отчет о структуре сети в файл HTML» НА РАБОЧИЙ СТОЛ «до модификации»
Затем -> «Справочники и ключи»-> «Создать справочники»-> «Создать для всего списка»
27. Переходим в net1-admin и заходим в УКЦ (если справочники не появились, перезапускаем УКЦ)
«Сетевые узлы»-> “выделяем все справчночники, кроме «Ivanov»-> ПКМ”-> «выдать дистрибутив ключей» и выдаем пароли
Создаем папку «modif» туда переносим папку «Пользователь_2 Филиал» внутри должны быть папки Petrov, User
28. Переходим в net2- operCA перезаходим в випнет клиент 
«фильтры открытой сети»-> «создать»-> «ПРОПУСКАТЬ ТРАФИК»-> «применить» -> «защищенная сеть»
во вкладке защищенная сеть нажимаем в верху экрана ПО «проверить»
29. ¬¬на net1-open в ЦУС во вкладке клиенты должно быть написано «готовы к отправке»-> «справочники и ключи»-> «отправить справочники и ключи» «отправить на все ключи»
30. Переходим в net2- operCA
во вкладке защищенная сеть нажимаем в верху экрана ПО «проверить»
31. Переходим в net1- operCA
во вкладке защищенная сеть нажимаем в верху экрана ПО «принятые», а потом «проверить» и проверяем (можно пробовать перезайти в випнет) на машинах так до тех пор, пока все не будут «приняты», кроме «Ivanov».
После этого -> «моя сеть»-> «сохранить отчет о структуре сети в файл HTML» НА РАБОЧИЙ СТОЛ с названием «после модификации»
32. в net2- operCA заходим в «деловая почта», для этого в поисковой строке самой винды прям так и вводим, что нам надо
33. в этой «деловой почте» -> «письмо»-> «получатели»-> «AdminCA»-> сообщение пишем любое и отправляем
34. переходим в net1-Admin 
заходим в «деловая почта» и там должно быть входящее письмо и на него необходимо ответить
35. в net2- operCA заходим в «деловая почта» и там должно быть входящее письмо
36. в net2- operCA заходим в випнет клиент нажимаем «Главный администратор»-> «сообщение»-> «что-то пишем» 
37. на net1-admin должно внизу быть всплывающее окно с данным сообщением, нажимаем на него и отвечаем
38. на net1-admin заходим в УКЦ -> ПКМ на USER-> «ключи пользователя»-> «создать и сохранить РНПК в файл на рабочий стол»
-> ПКМ на USER-> «безопасность и плановые работы»-> «считать ключи скомпрометированными»
-> ПКМ на USER-> «ключи пользователя»-> «Создать и передать ключи в ЦУС»
Переходим в «сетевые узлы»-> выделяем все узлы, кроме «Ivanov»-> «создать и передать ключи в ЦУС»
39. ¬¬на net1-open в ЦУС ПКМ на «Пользователь_2 Филиал»-> «Отправить справочники и ключи»
40. в net2- operCA во вкладке защищенная сеть нажимаем в верху экрана ПО «проверить»
41. в випнет клиенте периодически нажимаем «проверить», все должно быть «доставлено»
42. На net1-open выделяем «Пользователь_2 Филиал»-> «справочники и ключи»-> «отправить справочники и ключи»-> «Отправить весь список»
43. Делаем проверку в випнет клиенте на всех машинах
44. С net2- operCA отправляем письмо главному администратору
айпи в коорд 1 -  1.2.3.1/ 255.255.255.240
айпи в коорд 1 -  2.3.4.1
Шлюз для 1 коорда 8.9.10.1
Шлюз для 2 коорда 8.9.10.2
Шлюз для 3 коорда 8.9.10.2
- На Admin3 - Управление компьютером/службы и приложения/службы/NccService/автоматически/применить/перезапустить
SQLServer (WINNCCSQL)/автоматически/перезапустить 
https://www.youtube.com/watch?v=FtPx5zL1JEE – ссылка на видео
